Netology/src/DataProcessors/ЗагрузкаПрайслистаКонтрагента/ЗагрузкаПрайслистаКонтрагента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаПрайслистаКонтрагента</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Netology/src/Documents/УстановкаЦен/УстановкаЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦен</name>
  <registerRecords>InformationRegister.ЦеныПоставщиков</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Цены</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Денежный</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Netology/src/DataProcessors/ЗагрузкаПрайслистаКонтрагента/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ВыборФайлаАсинхронно();
	
КонецПроцедуры

&НаКлиенте                 
Асинх Процедура ВыборФайлаАсинхронно()

	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Заголовок = "Выберите файл для загрузки";
	ДиалогВыбора.Фильтр = "CSV файлы|*.csv";
	
	РезультатВыбора = Ждать ДиалогВыбора.ВыбратьАсинх();
	
	Если РезультатВыбора = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Объект.ПутьКФайлу = РезультатВыбора[0];

КонецПроцедуры


&НаКлиенте
Процедура Загрузить(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда  
		
		Возврат;
		
	КонецЕсли;
	
	ЗагрузитьФайл();
	
КонецПроцедуры  

&НаКлиенте
Асинх Процедура ЗагрузитьФайл()
	
	ОписаниеФайла = Ждать ПоместитьФайлНаСерверАсинх( , , , Объект.ПутьКФайлу, УникальныйИдентификатор);
	РезультатЗагрузки = ЗагрузитьФайлНаСервере(ОписаниеФайла.Адрес, УникальныйИдентификатор);
	
	Если Не РезультатЗагрузки.ВсяНоменклатураНайдена Тогда
		
		ТекстВопроса = "Не вся номенклатура найдена. Выберите действие с такой номенклатурой";      
		ВариантОтвета = Новый СписокЗначений;
		ВариантОтвета.Вставить(0, 0, "Не создавать документ");
		ВариантОтвета.Вставить(1, 1, "Не загружать номенклатуру");
		ВариантОтвета.Вставить(2, 2, "Создавать номенклатуру");      
		
		ОтветПользователя = Ждать ВопросАсинх(ТекстВопроса, ВариантОтвета);	  
		
		Если ОтветПользователя = 0 Тогда
			
			Возврат;              
			
		ИначеЕсли ОтветПользователя = 1 Тогда
			
			СоздатьДокумент(Объект.Контрагент, РезультатЗагрузки.АдресДанныхФайла, СогласоватьЦены, 0);
			
		Иначе
			
			СоздатьДокумент(Объект.Контрагент, РезультатЗагрузки.АдресДанныхФайла, СогласоватьЦены, 1);
			
		КонецЕсли; 
		
	Иначе
		
		СоздатьДокумент(Объект.Контрагент, РезультатЗагрузки.АдресДанныхФайла, СогласоватьЦены, 1);
		
	КонецЕсли;
	

КонецПроцедуры  

&НаСервереБезКонтекста
Функция НайтиНоменклатуру(ДанныеФайла)
	
	ВсяНоменклатураНайдена = Истина;
	ШаблонСообщения = НСтр("ru = 'Не вся номенклатура найдена. Выберите действие с такой номенклатурой %1'");

	Для Каждого ДанныеСтроки Из ДанныеФайла Цикл

		Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(ДанныеСтроки.НаименованиеНоменклатуры);
		Если Не ЗначениеЗаполнено(Номенклатура) Тогда

			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон(ШаблонСообщения, ДанныеСтроки.НаименованиеНоменклатуры);
			Сообщение.Сообщить();

			ВсяНоменклатураНайдена = Ложь;
		КонецЕсли;                                    
		
		ДанныеСтроки.Вставить("НоменклатураСсылка", Номенклатура);

	КонецЦикла;

	Возврат ВсяНоменклатураНайдена;

КонецФункции

&НаСервереБезКонтекста
Процедура ПрочитатьФайл(ИмяВременногоФайла, РезультатЗагрузки, УникальныйИдентификатор)
	
	ТекстовыйФайлЗагрузки = Новый ТекстовыйДокумент;
	ТекстовыйФайлЗагрузки.Прочитать(ИмяВременногоФайла, КодировкаТекста.UTF8);

	ДанныеФайла = Новый Массив;
	ШаблонСообщения = НСтр("ru = 'Номенклатура: %1 не найдена'");

	Для НомерСтроки = 1 по ТекстовыйФайлЗагрузки.КоличествоСтрок() Цикл

		НоваяСтрока = ТекстовыйФайлЗагрузки.ПолучитьСтроку(НомерСтроки);

		Позиция = Найти(НоваяСтрока, ";");

		НаименованиеНоменклатуры = Сред(НоваяСтрока, 1, Позиция - 1);
		Цена = Сред(НоваяСтрока, Позиция + 1);

		ДанныеСтрокиДокумента = Новый Структура;
		ДанныеСтрокиДокумента.Вставить("НаименованиеНоменклатуры", НаименованиеНоменклатуры);
		ДанныеСтрокиДокумента.Вставить("Цена", Цена);

		Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(НаименованиеНоменклатуры); 
		Если Не ЗначениеЗаполнено(Номенклатура) Тогда

			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон(ШаблонСообщения, НаименованиеНоменклатуры);
			Сообщение.Сообщить();

			РезультатЗагрузки.ВсяНоменклатураНайдена = Ложь; 
			
		КонецЕсли;                                
		
		ДанныеСтрокиДокумента.Вставить("НоменклатураСсылка", Номенклатура);
		
		ДанныеФайла.Добавить(ДанныеСтрокиДокумента);

	КонецЦикла;

	РезультатЗагрузки.АдресДанныхФайла = ПоместитьВоВременноеХранилище(ДанныеФайла, УникальныйИдентификатор);
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ЗагрузитьФайлНаСервере(АдресФайлаВоВременномХранилище, УникальныйИдентификатор)

	ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("csv");
	ДвоичныеДанныеФайла.Записать(ИмяВременногоФайла);
	
	РезультатЗагрузки = Новый Структура("ВсяНоменклатураНайдена, АдресДанныхФайла", Истина, Неопределено);
	ПрочитатьФайл(ИмяВременногоФайла, РезультатЗагрузки, УникальныйИдентификатор);
	
	УдалитьФайлы(ИмяВременногоФайла);
	УдалитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);
	
	Возврат РезультатЗагрузки;
	
КонецФункции

&НаСервереБезКонтекста
Процедура СоздатьДокумент(Контрагент, АдресДанныхФайла, СогласоватьЦены, ЗаписьНовойНоменклатуры)   
	
	ДокументЦены = Документы.УстановкаЦен.СоздатьДокумент();
	ДокументЦены.Дата = ТекущаяДата();
	ДокументЦены.Контрагент = Контрагент;
	ДокументЦены.Комментарий = "Загружен из файла";

	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресДанныхФайла);         
	
	Для Каждого ДанныеСтроки Из ДанныеФайла Цикл

		Номенклатура = ДанныеСтроки.НоменклатураСсылка;

		Если Не ЗначениеЗаполнено(Номенклатура) Тогда
			
			Если ЗаписьНовойНоменклатуры Тогда
				
				НоваяНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
				НоваяНоменклатура.Наименование = ДанныеСтроки.НаименованиеНоменклатуры;
				НоваяНоменклатура.Записать();
				
				Номенклатура = НоваяНоменклатура.Ссылка;
				
			Иначе
				
				Продолжить;
				
			КонецЕсли;
			
		КонецЕсли;

		НоваяСтрокаТЧ = ДокументЦены.Цены.Добавить();
		НоваяСтрокаТЧ.Номенклатура = Номенклатура;
		НоваяСтрокаТЧ.Цена = ДанныеСтроки.Цена;

	КонецЦикла;

	Если СогласоватьЦены Тогда
		
		ДокументЦены.Записать(РежимЗаписиДокумента.Проведение);
		
	Иначе
		
		ДокументЦены.Записать();  
		
	КонецЕсли;


	УдалитьИзВременногоХранилища(АдресДанныхФайла);

КонецПроцедуры
